# Задача 2: Найдите сумму цифр трехзначного числа.
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

a = input('введите трехзначное число:  ')
b = int(a)
if b > 99 and b < 1000:  
    a1 = int(a[0])
    a2 = int(a[1])
    a3 = int(a[2])
    sum = a1 + a2 + a3
    print(sum)
else:
    print('Вы ввели не трехзначное число')